leetcode_980_unique_paths_iii.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 980. Unique Paths III</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 980. Unique Paths III</h1>
<p>
<a href="https://leetcode.com/problems/unique-paths-iii/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="can_we_use_brute_force_to_solve_the_problem.html#ID-29512D97-A54D-42F9-A8C7-C3422881933B">Can we use brute-force to solve the problem?</a>  We can't but it is possible memorize all possible states of current position and all visited ones.  Time complexity is \(O(2^k \times k)\) where \(k\) is \(n \times m \leq 20\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">uniquePathsIII</span>(<span style="font-weight: bold;">self</span>, g: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(g)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(g[0])
        <span style="font-weight: bold; font-style: italic;">D</span> = [[+1, +0], [-1, +0], [+0, +1], [+0, -1]]
        <span style="font-weight: bold; font-style: italic;">ALL</span> = 0

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">b</span>(i, j):
            <span style="font-weight: bold;">return</span> 1 &lt;&lt; (i * M + j)

        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                <span style="font-weight: bold;">if</span> g[i][j] == 1:
                    <span style="font-weight: bold; font-style: italic;">si</span> = i
                    <span style="font-weight: bold; font-style: italic;">sj</span> = j
                <span style="font-weight: bold;">if</span> g[i][j] == 2:
                    <span style="font-weight: bold; font-style: italic;">ei</span> = i
                    <span style="font-weight: bold; font-style: italic;">ej</span> = j
                <span style="font-weight: bold;">if</span> g[i][j] != -1:
                    <span style="font-weight: bold; font-style: italic;">ALL</span> = ALL | b(i, j)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(i, j, vis):
            <span style="font-weight: bold;">if</span> i == ei <span style="font-weight: bold;">and</span> j == ej:
                <span style="font-weight: bold;">return</span> 1 <span style="font-weight: bold;">if</span> vis == ALL <span style="font-weight: bold;">else</span> 0
            ans = 0
            <span style="font-weight: bold;">for</span> di, dj <span style="font-weight: bold;">in</span> D:
                ni = di + i
                nj = dj + j
                <span style="font-weight: bold;">if</span> (
                    0 &lt;= ni &lt; N
                    <span style="font-weight: bold;">and</span> 0 &lt;= nj &lt; M
                    <span style="font-weight: bold;">and</span> g[ni][nj] != -1
                    <span style="font-weight: bold;">and</span> vis &amp; b(ni, nj) == 0
                ):
                    ans += dfs(ni, nj, vis | b(ni, nj))
            <span style="font-weight: bold;">return</span> ans

        <span style="font-weight: bold;">return</span> dfs(si, sj, b(si, sj))


<span style="font-weight: bold;">assert</span> Solution().uniquePathsIII([[1, 0, 0, 0], [0, 0, 0, 0], [0, 0, 2, -1]]) == 2
<span style="font-weight: bold;">assert</span> Solution().uniquePathsIII([[1, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 2]]) == 4
<span style="font-weight: bold;">assert</span> Solution().uniquePathsIII([[0, 1], [2, 0]]) == 0
</pre>
</div>
</div>
</body>
</html>